<a href="https://colab.research.google.com/github/yooste/SOLUX_summer_data/blob/master/2%EC%A3%BC%EC%B0%A8/pandas_chap08_0730.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
# 이름, 학과, 성별이 포함된 학생 정보 리스트로 데이터 프레임 생성
student_list = [{'name':'John','major':'Computer Science','sex':'male'},
                {'name':'Nate','major':'Computer Science','sex':'male'},
                {'name':'Abraham','major':'Physics','sex':'male'},
                {'name':'Brian','major':'Psychology','sex':'male'},
                {'name':'Jenny','major':'Economics','sex':'female'},
                {'name':'Yuna','major':'Economics','sex':'female'},
                {'name':'Jeniffer','major':'Computer Science','sex':'female'},
                {'name':'Edward','major':'Computer Science','sex':'male'},
                {'name':'Zara','major':'Psychology','sex':'female'},
                {'name':'Wendy','major':'Economics','sex':'female'},
                {'name':'Sera','major':'Psychology','sex':'female'}
]
df = pd.DataFrame(student_list, columns = ['name','major','sex'])

In [4]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Jenny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [6]:
groupby_major = df.groupby('major')   # 학과 정보로 정보 추출하기

In [7]:
groupby_major.groups    # 학과 별로 묶인 것을 볼 수 있음

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5, 9], dtype='int64'),
 'Physics': Int64Index([2], dtype='int64'),
 'Psychology': Int64Index([3, 8, 10], dtype='int64')}

In [8]:
for name, group in groupby_major:
  print(name + ' : '+str(len(group))) # 학과 별로 몇 명이 있는지 보여줌
  print(group)  # 그룹 출력
  print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Jenny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [11]:
# 그룹별 인덱스 개수를 나타내는 데이터프레임 생성
df_major_cnt = pd.DataFrame({'count':groupby_major.size()}).reset_index() 
df_major_cnt

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [12]:
groupby_sex = df.groupby('sex')   # 성별로 그룹화

In [13]:
for name, group in groupby_sex:   # 성별로 묶은 그룹의 정보를 보여줌
  print(name+' : '+str(len(group)))
  print(group)
  print()

female : 6
        name             major     sex
4      Jenny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

male : 5
      name             major   sex
0     John  Computer Science  male
1     Nate  Computer Science  male
2  Abraham           Physics  male
3    Brian        Psychology  male
7   Edward  Computer Science  male